---
kind: other
id: Properties.T:Autodesk.Revit.DB.BackgroundSettings
source: html/32df28c4-27bc-0d75-0065-6dc9475dd7bd.htm
---
# BackgroundSettings Properties

Specifies whether the .NET object represents a valid Revit entity.